[{
        "_id": "123",
        "name": "Intro to HTML",
        "title": "LEARNING OBJECTIVES",
        "description": "Stepping stone into the world of web development, where you'll learn the fundamental language for structuring and creating content on the web, equipping you with the essentials to kickstart your journey as a web developer.",
        "course": "CS101"
    },
    {
        "_id": "124",
        "name": "Intro to CSS",
        "title": "LEARNING OBJECTIVES",
        "description": "Introduction to CSS is your gateway to the art of web design and styling. Dive into the world of cascading style sheets and learn how to transform plain HTML into visually appealing and responsive web pages.",
        "course": "CS101"
    },
    {
        "_id": "125",
        "name": "Intro to the course",
        "title": "Course Introduction",
        "description": "Introduction to Course: Intro to Software Engineering is the starting point on your journey to becoming a proficient software engineer. Explore the foundational concepts, tools, and methodologies that will empower you to create and innovate with software.",
        "course": "CS102"
    },

    {
        "_id": "123",
        "name": "Review OOD principles",
        "title": "LEARNING OBJECTIVES",
        "description": "Review previous OOD concepts is a refresher course designed to strengthen your understanding of Object-Oriented Design principles and techniques. Dive back into the core concepts of OOD, ensuring you have a solid foundation for more advanced software engineering endeavors.",
        "course": "CS102"
    },

    {
        "_id": "126",
        "name": "Intro to the course",
        "title": "Course Introduction",
        "description": "Database is your gateway to the world of data management and storage. Explore the fundamental principles and technologies that underpin the efficient and secure handling of data, a vital skill for modern applications and businesses.",
        "course": "CS103"
    },

    {
        "_id": "127",
        "name": "Intro to SQL",
        "title": "LEARNING OBJECTIVES",
        "description": "Introduction to SQL is your first step into the world of structured query language, the backbone of database management. Learn how to interact with and manipulate data in relational databases, a fundamental skill for anyone involved in data analysis, software development, or database administration.",
        "course": "CS103"
    },


    {
        "_id": "128",
        "name": "Intro to the course",
        "title": "Course Introduction",
        "description": "Object Oriented Design is your entry point into the realm of software architecture and design patterns. Gain a strong foundation in creating efficient, scalable, and maintainable software systems through the principles and practices of Object-Oriented Design.",
        "course": "CS104"
    },

    {
        "_id": "129",
        "name": "Intro to Polymorphism",
        "title": "LEARNING OBJECTIVES",
        "description": "Polymorphism is a concept that allows objects of different classes to be treated as objects of a common superclass, promoting flexibility and extensibility in object-oriented programming. Explore the power of polymorphism in this course and learn how to design and implement versatile and reusable software components.",
        "course": "CS104"
    }


]